# Specifying Set Arithmetic for Joins

In [5]:
import pandas as pd
import numpy as np

In [6]:
class Display(object):
    """
        Displaying HTML represantation of multiple object
    """
    template = """
        <div style = "float: left; padding: 10px;">
        <p style = "font-family: 'Courier New', Courier, monospace">{0}{1}
    """
    
    def __init__(self, *args):
        self.args = args
        
    def _repr_html_(self):
        return '\n'.join(self.template.format(a, eval(a)._repr_html_()) for a in self.args)
    
    def __repr__(self) -> str:
        return '\n\n'.join(a + '\n' + repr(eval(a)) for a in self.args)

In [7]:
df6 = pd.DataFrame(
    {
        'name': ['Peter', 'Paul', 'Mary'],
        'food': ['fish', 'beans', 'bread']
    }, columns=['name', 'food']
)
df7 = pd.DataFrame(
    {
        'name': ['Mary', 'Joseph'], 
        'drink': ['wine', 'beer']
     }, columns=['name', 'drink']
)

In [12]:
Display('df6', 'df7')

df6
    name   food
0  Peter   fish
1   Paul  beans
2   Mary  bread

df7
     name drink
0    Mary  wine
1  Joseph  beer

inner join

In [8]:
pd.merge(df6, df7)

   name   food drink
0  Mary  bread  wine

An outer join
returns a join over the union of the input columns and fills in missing values with
NAs:

In [15]:
pd.merge(df6, df7, how = 'outer')

     name   food drink
0   Peter   fish   NaN
1    Paul  beans   NaN
2    Mary  bread  wine
3  Joseph    NaN  beer